---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
source: html/10e73ef5-1dc3-823a-21c4-d8946a6e47fe.htm
---
# AnalysisDisplayStyle Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.